<template>
    <div>
        <ve-line :data="chartData"></ve-line>
    </div>
</template>
<script>
import VeLine from 'v-charts/lib/line'
export default {
    created () {
        this.chartData = {
            columns: ['时间', '请求数', '调用数'],
            rows: [
                { '时间': '9:00', '请求数': 20, '调用数': 3 },
                { '时间': '9:01', '请求数': 23, '调用数': 4 },
                { '时间': '9:02', '请求数': 24, '调用数': 3 },
                { '时间': '9:03', '请求数': 41, '调用数': 5 },
                { '时间': '9:04', '请求数': 31, '调用数': 7 },
                { '时间': '9:05', '请求数': 23, '调用数': 3 },
                { '时间': '9:06', '请求数': 30, '调用数': 4 },
                { '时间': '9:07', '请求数': 31, '调用数': 2 },
                { '时间': '9:08', '请求数': 34, '调用数': 6 },
                { '时间': '9:09', '请求数': 29, '调用数': 3 },
                { '时间': '9:10', '请求数': 28, '调用数': 5 },
                { '时间': '9:11', '请求数': 15, '调用数': 3 },
                { '时间': '9:12', '请求数': 14, '调用数': 3 },
                { '时间': '9:13', '请求数': 13, '调用数': 7 },
                { '时间': '9:14', '请求数': 10, '调用数': 3 },
                { '时间': '9:15', '请求数': 5, '调用数': 4 },
                { '时间': '9:16', '请求数': 10, '调用数': 3 },
                { '时间': '9:17', '请求数': 12, '调用数': 1 },
                { '时间': '9:18', '请求数': 13, '调用数': 3 },
                { '时间': '9:19', '请求数': 15, '调用数': 5 },
                { '时间': '9:20', '请求数': 23, '调用数': 3 },
                { '时间': '9:21', '请求数': 17, '调用数': 4 }
            ]
        }
    },
    components: { VeLine }
}
</script>
<style scoped>
</style>
